---
kind: other
id: Properties.T:Autodesk.Revit.Exceptions.ModificationForbiddenException
source: html/c3b09941-3c33-02ba-d69c-52319f2b4185.htm
---
# ModificationForbiddenException Properties

The information of the function throwing the exception.